'******* 변수선언 ***********************



'*******모터동시제어설정****************
CONST 하한전압 = 103	'약6V전압
PTP SETON 		'단위그룹별 점대점동작 설정
PTP ALLON		'전체모터 점대점 동작 설정


'*******모터방향설정*********************
DIR G6A,1,0,0,1,0,0	'왼쪽다리:모터0~5번
DIR G6D,0,1,1,0,1,0	'오른쪽다리:모터18~23번
DIR G6B,1,1,1,1,1,1	'왼쪽팔:모터6~11번
DIR G6C,0,0,0,0,0,0	'오른쪽팔:모터12~17번


'***** 초기선언 *********************************
모터ONOFF = 0
보행순서 = 0
반전체크 = 0
기울기확인횟수 = 0
넘어진확인 = 0
기울기센서측정여부 = 1
홍보모드방향지시여부 = 0
물건집은상태 = 0


'****초기위치 *****************************
GOSUB MOTOR_GET '모터위치값피드백
GOSUB MOTOR_ON  '모터사용설정